# Assignment Operator คือ เครื่องหมายที่ใช้ในการกําหนดค่าให้กับตัวแปร
#การทำงานของ = คือ เอาทางขวามาใส่ทางซ้าย
# ยกเว้นเสียแต่ว่า สิ่งที่อยู่ทางขวามีการทำงานใดๆ ให้ทำให้เสร็จแล้วเอาผลไปใส่ทางซ้าย
# ตัวแปร (varible) = ข้อมูล (data)/นิพจน์ (expression)
# ***ตัวแปร (varible) คือ ชื่อที่dev. ตั้งชึ้นมาเอง เอาไว้เก็บข้อมูลที่เกิดขึ้นในโปรแกรม
# *** การใฃ้งานตัวแปร คือ เอาช้อมูลไปใส่ในตัวแปร หรือ เอาช้อมูลที่มันเก็บอยุ๋มาใฃ้

score = 20
fullname = 'สมชาย'
salary = input('ป้อนเงินเดือน')
sum = 20 + 30 
print ('--------------------------------')
num = 10 
# ตัวดำเนินการกำหนดค่าอย่างย่อ
num += 10 # num = num + 10 
num -= 10 # num = num - 10
num *= 10 # num = num * 10
num /= 10 # num = num / 10
num %= 10 # num = num % 10
num //= 10 # num = num // 10
print (num)
print ('--------------------------------')
