#โปรแกรมตรวจสอบรถว่าผ่านเกณฑ์ของการตรวจสอบค่าคาร์บอนไดซ์ออกไซน์หรือ โดยหากค่าคาร์บอนไดซ์ออกไซน์มีค่าเกินกว่า 678.55 
# ให้แสดงข้อความว่า “ไม่ผ่าน”  หากน้อยกว่า 678.55 ให้แสดงข้อความ “ผ่าน” โดยให้รับชื่อเจ้าของ ทะเบียนรถ และปริมาณก๊าซคาร์บอนไดซ์ออกไซน์ที่วัดได้ 
# ทางแป้นพิมพ์

print ('--------------------------------')
print('     ตรวจสอบสภาพรถ       ')
print ('--------------------------------')
car_owner = input('ป้อนชื่อเจ้าของรถ')
car_number = input('ป้อนทะเบียนรถ')
car_carbon = float(input('ป้อนปริมาณก๊าซคารบอนไดซ์ออกไซด์'))
print ('--------------------------------')
if car_carbon >= 678.55 :
    print(f'เจ้าของ {car_owner} ทะเบียน {car_number} ไม่ผ่านเกณฑ์')
    print('รถทะเบียน {} ของคุณ {} ไม่ผ่านเกณฑ์'.format(car_number,car_owner))
else :
    print(f'เจ้าของ {car_owner} ทะเบียน {car_number} ผ่านเกณฑ์')
    print('รถทะเบียน {} ของคุณ {} ผ่านเกณฑ์'.format(car_number,car_owner))
print ('--------------------------------')